## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

# create series
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)

# print series
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
import pandas as pd

# create list
my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

# convert list to pandas series
my_series = pd.Series(my_list)

# print the series
print(my_series)

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

## Q3. Create a Pandas DataFrame that contains the following data:
 Name 
Alice 
Bob 
Claire 
Then, print the DataFrame. 
Age 25 
30 
27 
Gender Female Male 
Female

In [10]:
Name = ["Alice", "Bob", "Claire"]

Age = [25, 30, 27]

Gender = ["Female", "Male", "Female"]

data ={"Name":Name, "Age":Age, "Gender":Gender}

pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A Pandas Series is a one-dimensional labeled array that can hold data of any type (integer, float, string, etc.). It has an index that can be used to access its values. In contrast, a Pandas DataFrame is a two-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or a SQL table. It is essentially a collection of Pandas Series that share the same index.

To illustrate this difference, let's consider an example. Suppose we have data about the sales of different products in different regions. We can represent this data as a Pandas DataFrame, where each column represents a region and each row represents a product:

In [12]:
data = {
    'Product': ['A', 'B', 'C', 'D', 'E'],
    'Region 1': [100, 200, 150, 300, 250],
    'Region 2': [150, 180, 120, 220, 300],
    'Region 3': [80, 120, 100, 180, 150]
}

df = pd.DataFrame(data)

df

  Product  Region 1  Region 2  Region 3
0       A       100       150        80
1       B       200       180       120
2       C       150       120       100
3       D       300       220       180
4       E       250       300       150

In this example, the columns `Region 1`, `Region 2`, and `Region 3` are `Pandas Series`, while the entire table is a `Pandas DataFrame`. We can access each column (i.e., each Series) using the column name, like `df['Region 1']`. Similarly, we can access each row using the row index, like `df.loc[0]`.

In [13]:
df["Region 1"]

0    100
1    200
2    150
3    300
4    250
Name: Region 1, dtype: int64

In [14]:
type(df), type(df["Region 1"])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

1. `head()` and `tail()`: These functions allow you to view the first or last few rows of a DataFrame. You might use them to get a quick idea of what your data looks like, especially if you have a large dataset.

In [15]:
df.head(2), df.tail(2)

(  Product  Region 1  Region 2  Region 3
 0       A       100       150        80
 1       B       200       180       120,
   Product  Region 1  Region 2  Region 3
 3       D       300       220       180
 4       E       250       300       150)

`df.columns` is a Pandas DataFrame attribute that returns a list of column names in the DataFrame `df`. It can be useful for getting a quick overview of the columns in a DataFrame or for selecting specific columns for analysis.

In [23]:
df.columns

Index(['Product', 'Region 1', 'Region 2', 'Region 3'], dtype='object')

`df.dtypes` is a Pandas DataFrame attribute that returns the data type of each column in the DataFrame df. It can be useful for understanding the data types of the columns in a DataFrame, especially when working with large and complex datasets.

In [18]:
df.dtypes

Product     object
Region 1     int64
Region 2     int64
Region 3     int64
dtype: object

`df[["columns1","columns2"..."columns3"]]` is Pandas DataFrame syntax used for selecting specific columns from a DataFrame. It returns a new DataFrame that contains only the columns specified in the brackets.

In [22]:
df[["Product","Region 1"]]

  Product  Region 1
0       A       100
1       B       200
2       C       150
3       D       300
4       E       250

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, both Series and DataFrame are mutable in nature, meaning their values can be modified after they are created. Panel, on the other hand, is not mutable and is considered a deprecated data structure as of Pandas version 1.0.0.

When we modify a Series or a DataFrame, the changes are made in place and the original object is modified. This means that any references to the modified object will reflect the changes that were made.

In [27]:
df

  Product  Region 1  Region 2  Region 3
0       A       100       150        80
1       B       300       180       120
2       C       150       120       100
3       D       300       220       180
4       E       250       300       150

In [35]:
import warnings
warnings.filterwarnings("ignore")

In [36]:
df["Product"][0] = "N"

In [38]:
df ## DataFrame Manupulation in pandas

  Product  Region 1  Region 2  Region 3
0       N       100       150        80
1       B       300       180       120
2       C       150       120       100
3       D       300       220       180
4       E       250       300       150

In [39]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [42]:
# Seriers Manupulation in pandas
series[1] = 12
series

0     4
1    12
2    15
3    16
4    23
5    42
dtype: int64

## Q7. Create a DataFrame using multiple Series. Explain with an example.

To create a DataFrame using multiple Series in Pandas, you can pass a dictionary of Series to the pd.DataFrame() constructor. Each key-value pair in the dictionary represents a column in the DataFrame, where the key is the name of the column and the value is the Series object.

In [53]:
# create Pandas Series for the columns
no_of_fruits = pd.Series([10, 20, 30])
fruits = pd.Series(['apple', 'banana', 'orange'])

# create dictionary with column names as keys and Pandas Series as values
data = {'No of fruits': no_of_fruits, 'fruits': fruits}

# create Pandas DataFrame from dictionary
df = pd.DataFrame(data)

# print the resulting DataFrame
df

   No of fruits  fruits
0            10   apple
1            20  banana
2            30  orange